c5/src/InformationRegisters/Passwords/Passwords.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Passwords</name>
  <resources>
    <name>Password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/InformationRegisters/Membership/Membership.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Membership</name>
  <dimensions>
    <name>Membership</name>
    <comment>Do not use name &quot;Group&quot;</comment>
    <type>
      <types>CatalogRef.Membership</types>
    </type>
  </dimensions>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessRevoked</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeInternalOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Login</name>
    <type>
      <types>CatalogRef.Logins</types>
    </type>
  </attributes>
  <attributes>
    <name>OrganizationAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>OSAuth</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OSUser</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Protection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Show</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingDistance</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingPeriodicity</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingProvider</name>
    <type>
      <types>EnumRef.Providers</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingTime</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackLocation</name>
    <type>
      <types>EnumRef.Tracking</types>
    </type>
  </attributes>
  <attributes>
    <name>UserClass</name>
    <type>
      <types>EnumRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Companies</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Organizations</name>
    <attributes>
      <name>Organization</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OrganizationsStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Warehouses</name>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WarehousesStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/Catalogs/Membership/Membership.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Membership</name>
  <predefined>
    <items>
      <name>Users</name>
      <description>Users</description>
    </items>
  </predefined>
  <attributes>
    <name>TenantAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Tenants</name>
    <attributes>
      <name>Tenant</name>
      <type>
        <types>CatalogRef.Tenants</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/CommonModules/LoginsSrv/Module.bsl
Procedure ChangePassword ( User, Password ) export
	
	name = "" + User;
	ibuser = InfoBaseUsers.FindByName ( name );
	ibuser.Password = Password;
	ibuser.Write ();
	LoginsSrv.SavePassword ( User, Password );
	
EndProcedure 

Procedure SavePassword ( User, Password ) export
	
	r = InformationRegisters.Passwords.CreateRecordManager ();
	r.User = User;
	r.Password = Password;
	r.Write ();
	
EndProcedure 

Procedure ResetMustChangePassword () export
	
	obj = SessionParameters.Login.GetObject ();
	obj.MustChangePassword = false;
	obj.Write ();
	
EndProcedure 

Procedure SetRights ( User ) export
	
	SetPrivilegedMode ( true );
	roles = getUserRoles ( User.Name );
	assingRoles ( User, roles );
	
EndProcedure 

Function getUserRoles ( UserName )
	
	s = "
	|select Rights.RoleName as RoleName
	|from Catalog.Users.Rights as Rights
	|where Rights.Ref = &User
	|union
	|select Rights.RoleName
	|from Catalog.Membership.Rights as Rights
	|	//
	|	// Memberships
	|	//
	|	join InformationRegister.Membership as Memberships
	|	on Memberships.User = &User
	|	and Memberships.Membership = Rights.Ref
	|where not Rights.Ref.DeletionMark
	|";
	q = new Query ( s );
	user = Catalogs.Users.FindByDescription ( UserName, true );
	q.SetParameter ( "User", user );
	return q.Execute ().Unload ().UnloadColumn ( "RoleName" );
	
EndFunction 

Procedure assingRoles ( User, Roles )
	
	userRoles = User.Roles;
	appRoles = Metadata.Roles;
	wasUnlimited = userRoles.Contains ( appRoles.Unlimited );
	wasSysadmin = userRoles.Contains ( appRoles.AdministratorSystem );
	root = Logins.Sysadmin ();
	unlimited = Enum.SuperRolesUnlimited ();
	sysadmin = Enum.SuperRolesSysadmin ();
	userRoles.Clear ();
	userRoles.Add ( appRoles.User );
	for each roleName in Roles do
		role = appRoles.Find ( roleName );
		if ( role = undefined ) then
			apply = false;
		elsif ( root ) then
			apply = true;
		elsif ( roleName = unlimited
			and not wasUnlimited ) then
			apply = false;
		elsif ( roleName = sysadmin
			and not wasSysadmin ) then
			apply = false;
		else
			apply = true;
		endif;
		if ( apply ) then
			userRoles.Add ( role );
		endif;
	enddo; 
	
EndProcedure 

Procedure Remove ( UserName ) export
	
	user = InfoBaseUsers.FindByName ( UserName );
	if ( user = undefined ) then
		return;
	endif; 
	user.Delete ();
	
EndProcedure 

Function LastAdministrator () export
	
	if ( findAdmin () ) then
		return false;
	endif;
	Output.AdministratorNotFound ();
	return true;
	
EndFunction 

Function findAdmin ()
	
	s = "
	|select top 1 1
	|from Catalog.Users.Rights as Rights
	|where Rights.RoleName = ""Administrator""
	|and not Rights.Ref.DeletionMark
	|and not Rights.Ref.AccessDenied
	|and not Rights.Ref.AccessRevoked
	|union
	|select top 1 1
	|from Catalog.Membership.Rights as Rights
	|	//
	|	// Memberships
	|	//
	|	join InformationRegister.Membership as Memberships
	|	on Memberships.Membership = Rights.Ref
	|	and not Memberships.User.DeletionMark
	|	and not Memberships.User.AccessDenied
	|	and not Memberships.User.AccessRevoked
	|where Rights.RoleName = ""Administrator""
	|and not Rights.Ref.DeletionMark
	|";
	q = new Query ( s );
	found = not q.Execute ().IsEmpty ();
	return found;
	
EndFunction

Procedure SaveSettings ( ID, Class = undefined, Value ) export
	
	if ( AccessRight ( "SaveUserData", Metadata ) ) then
		CommonSettingsStorage.Save ( ID, Class, Value );
	endif; 
	
EndProcedure

Procedure DeleteSettings ( ID, Class = undefined ) export
	
	if ( AccessRight ( "SaveUserData", Metadata ) ) then
		CommonSettingsStorage.Delete ( ID, Class, String ( SessionParameters.User ) );
	endif; 
	
EndProcedure

Function Separated () export
	
	return Metadata.CommonAttributes.Tenant.UsersSeparation = Metadata.ObjectProperties.CommonAttributeUsersSeparation.Separate;
	
EndFunction
